[Killed] Bitwise mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:7:87
 {
     // Anchored: the whole input must be a pitch ("Eb2" is not a sharp pitch, even though it ends with "b2").
     // Octave range matches Octave (-1..9).
-    private static readonly PcreRegex _sharpRegex = new(@"\A([A-G])(#?)(-1|[0-9])\z", PcreOptions.Compiled | PcreOptions.IgnoreCase);
+    private static readonly PcreRegex _sharpRegex = new(@"\A([A-G])(#?)(-1|[0-9])\z", PcreOptions.Compiled & PcreOptions.IgnoreCase);
     private static readonly PcreRegex _flatRegex = new(@"\A([A-G])(b?)(-1|[0-9])\z", PcreOptions.Compiled | PcreOptions.IgnoreCase);
 
killedBy: GA.Domain.Core.Tests.Primitives.PitchTests.SharpPitch_TryParse_Valid("c4","C4")

[Killed] Bitwise mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:8:86
     // Anchored: the whole input must be a pitch ("Eb2" is not a sharp pitch, even though it ends with "b2").
     // Octave range matches Octave (-1..9).
     private static readonly PcreRegex _sharpRegex = new(@"\A([A-G])(#?)(-1|[0-9])\z", PcreOptions.Compiled | PcreOptions.IgnoreCase);
-    private static readonly PcreRegex _flatRegex = new(@"\A([A-G])(b?)(-1|[0-9])\z", PcreOptions.Compiled | PcreOptions.IgnoreCase);
+    private static readonly PcreRegex _flatRegex = new(@"\A([A-G])(b?)(-1|[0-9])\z", PcreOptions.Compiled & PcreOptions.IgnoreCase);
 
     public static bool TryParse<TAccidental, TKeyNote, TPitch>(
killedBy: GA.Domain.Core.Tests.Primitives.PitchTests.FlatPitch_TryParse_Valid("bb3","Bb3")

[Killed] String mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:8:56
     // Anchored: the whole input must be a pitch ("Eb2" is not a sharp pitch, even though it ends with "b2").
     // Octave range matches Octave (-1..9).
     private static readonly PcreRegex _sharpRegex = new(@"\A([A-G])(#?)(-1|[0-9])\z", PcreOptions.Compiled | PcreOptions.IgnoreCase);
-    private static readonly PcreRegex _flatRegex = new(@"\A([A-G])(b?)(-1|[0-9])\z", PcreOptions.Compiled | PcreOptions.IgnoreCase);
+    private static readonly PcreRegex _flatRegex = new("", PcreOptions.Compiled | PcreOptions.IgnoreCase);
 
     public static bool TryParse<TAccidental, TKeyNote, TPitch>(
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[Killed] Negate expression
GA.Domain.Core/Primitives/Notes/PitchParser.cs:20:13
         where TPitch : Pitch
     {
         result = default!;
-        if (string.IsNullOrWhiteSpace(s))
+        if (!(string.IsNullOrWhiteSpace(s)))
         {
             return false;
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_InvalidInput_ReturnsFalse(null); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0)

[Killed] String mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:20:13
         where TPitch : Pitch
     {
         result = default!;
-        if (string.IsNullOrWhiteSpace(s))
+        if ((s!=""))
         {
             return false;
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[Killed] Conditional (false) mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:25:21
             return false;
         }
 
-        var regex = typeof(TAccidental) == typeof(SharpAccidental) ? _sharpRegex : _flatRegex;
+        var regex = (false?_sharpRegex :_flatRegex);
 
         var match = regex.Match(s);
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[Killed] Equality mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:25:21
             return false;
         }
 
-        var regex = typeof(TAccidental) == typeof(SharpAccidental) ? _sharpRegex : _flatRegex;
+        var regex = typeof(TAccidental) != typeof(SharpAccidental) ? _sharpRegex : _flatRegex;
 
         var match = regex.Match(s);
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:28:13
         var regex = typeof(TAccidental) == typeof(SharpAccidental) ? _sharpRegex : _flatRegex;
 
         var match = regex.Match(s);
-        if (!match.Success)
+        if (match.Success)
         {
             return false; // Failed
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[Killed] Boolean mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:30:20
         var match = regex.Match(s);
         if (!match.Success)
         {
-            return false; // Failed
+            return true; // Failed
         }
 
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_InvalidInput_ReturnsFalse("junkC4tail"); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_InvalidInput_ReturnsFalse("C4\n"); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_InvalidInput_ReturnsFalse("C10")

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:36:13
         var noteGroup = match.Groups[1];
         var accidentalGroup = match.Groups[2];
         var octaveGroup = match.Groups[3];
-        if (!noteGroup.IsDefined)
+        if (noteGroup.IsDefined)
         {
             return false; // Missing note
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[NoCoverage] Boolean mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:38:20
         var octaveGroup = match.Groups[3];
         if (!noteGroup.IsDefined)
         {
-            return false; // Missing note
+            return true; // Missing note
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:41:13
             return false; // Missing note
         }
 
-        if (!octaveGroup.IsDefined)
+        if (octaveGroup.IsDefined)
         {
             return false; // Missing octave
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[NoCoverage] Boolean mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:43:20
 
         if (!octaveGroup.IsDefined)
         {
-            return false; // Missing octave
+            return true; // Missing octave
         }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:47:13
         }
 
         // Parse natural note
-        if (!NaturalNote.TryParse(noteGroup.Value, null, out var naturalNote))
+        if (NaturalNote.TryParse(noteGroup.Value, null, out var naturalNote))
         {
             return false;
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[Killed] Equality mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:54:42
 
         // Parse accidental
         TAccidental? accidental = null;
-        if (accidentalGroup.IsDefined && accidentalGroup.Value.Length > 0)
+        if (accidentalGroup.IsDefined && accidentalGroup.Value.Length >= 0)
         {
             if (!TAccidental.TryParse(accidentalGroup.Value, null, out var parsedAccidental))
killedBy: GA.Domain.Core.Tests.Instruments.FretboardTests.CreateGuitar_HonoursRequestedFretCount; GA.Domain.Core.Tests.Instruments.TuningTests.Indexer_NumbersStringsFromTheTrebleSide("G4 D3 G3 B3 D4","D4","G4"); GA.Domain.Core.Tests.Instruments.TuningTests.Indexer_NumbersStringsFromTheTrebleSide("G4 C3 G3 B3 D4","D4","G4")

[Killed] Negate expression
GA.Domain.Core/Primitives/Notes/PitchParser.cs:54:13
 
         // Parse accidental
         TAccidental? accidental = null;
-        if (accidentalGroup.IsDefined && accidentalGroup.Value.Length > 0)
+        if (!(accidentalGroup.IsDefined && accidentalGroup.Value.Length > 0))
         {
             if (!TAccidental.TryParse(accidentalGroup.Value, null, out var parsedAccidental))
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:56:17
         TAccidental? accidental = null;
         if (accidentalGroup.IsDefined && accidentalGroup.Value.Length > 0)
         {
-            if (!TAccidental.TryParse(accidentalGroup.Value, null, out var parsedAccidental))
+            if (TAccidental.TryParse(accidentalGroup.Value, null, out var parsedAccidental))
             {
                 return false; // Never drop an accidental silently
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[NoCoverage] Boolean mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:58:24
         {
             if (!TAccidental.TryParse(accidentalGroup.Value, null, out var parsedAccidental))
             {
-                return false; // Never drop an accidental silently
+                return true; // Never drop an accidental silently
             }
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:65:13
         }
 
         // Parse octave
-        if (!int.TryParse(octaveGroup, out var parsedOctaveValue))
+        if (int.TryParse(octaveGroup, out var parsedOctaveValue))
         {
             return false;
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)

[Killed] Object initializer mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:70:22
             return false;
         }
 
-        var octave = new Octave { Value = parsedOctaveValue };
+        var octave = new Octave {};
 
         var note = createKeyNote(naturalNote, accidental);
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9); GA.Domain.Core.Tests.Instruments.TuningTests.Indexer_NumbersStringsFromTheTrebleSide("G4 D3 G3 B3 D4","D4","G4")

[Killed] Boolean mutation
GA.Domain.Core/Primitives/Notes/PitchParser.cs:76:16
 
         // Result
         result = createPitch(note, octave);
-        return true;
+        return false;
     }
 }
killedBy: GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(-1); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(0); GA.Domain.Core.Tests.CoreHardeningRegressionTests.PitchTryParse_SupportedOctaves_RoundTrip(9)
